In [3]:
# Series 연산
from pandas import Series

s1 = Series([10, 15, 20], index=['일','이','삼'])
s2 = Series([2,4,6,8], index=['일','이','삼','사'])

In [5]:
s1

일    10
이    15
삼    20
dtype: int64

In [7]:
s2

일    2
이    4
삼    6
사    8
dtype: int64

In [9]:
s1 + 100

일    110
이    115
삼    120
dtype: int64

In [12]:
s2 * 2

일     4
이     8
삼    12
사    16
dtype: int64

In [14]:
s1 + s2

사     NaN
삼    26.0
이    19.0
일    12.0
dtype: float64

In [20]:
s3 = Series([1,2,3],index=['1줄','2줄','3줄'])
s3

s1 + s3 #series 연산은 index가 맞아야한다

1줄   NaN
2줄   NaN
3줄   NaN
삼    NaN
이    NaN
일    NaN
dtype: float64

In [28]:
# DataFrame 연산

from pandas import DataFrame
import numpy as np

df1 = DataFrame(np.zeros((3,3), dtype='int32'), index=['one','two','three'])

df1

df2 = df1 + 3

df2

       0  1  2
one    3  3  3
two    3  3  3
three  3  3  3

In [30]:
df3 = DataFrame(np.ones((4,4), dtype='int32'), index=['one','two','three','four'])

df3

       0  1  2  3
one    1  1  1  1
two    1  1  1  1
three  1  1  1  1
four   1  1  1  1

In [32]:
df2 + df3 #index와 컬럼이 맞지않으면 NaN 값이 들어간다

         0    1    2   3
four   NaN  NaN  NaN NaN
one    4.0  4.0  4.0 NaN
three  4.0  4.0  4.0 NaN
two    4.0  4.0  4.0 NaN

In [38]:
df2.add(df3, fill_value=0) #sub() / mul() / div()

         0    1    2    3
four   1.0  1.0  1.0  1.0
one    4.0  4.0  4.0  1.0
three  4.0  4.0  4.0  1.0
two    4.0  4.0  4.0  1.0

문자열이 있는 데이타프레임의 연산

In [40]:
mydata = {
          'name':['홍길동','박길동','김길동'], 
          'age':[22,33,44], 
          'dept':['컴공','국어','산업']
         }

df = DataFrame(mydata)
df

  name  age dept
0  홍길동   22   컴공
1  박길동   33   국어
2  김길동   44   산업

In [ ]:
# df + 2 => 파이썬은 기본적으로 문자열 + 숫자 =>  무조건 에러

In [42]:
 df * 2 #=> 에러 나지 않음

     name  age  dept
0  홍길동홍길동   44  컴공컴공
1  박길동박길동   66  국어국어
2  김길동김길동   88  산업산업